Repository: zaheto/fantasy-theme
Catalog: resources/lang/*.po
Languages: el

source: Read More
el: Διαβάστε περισσότερα

source: Email address
el: Ηλεκτρονικη διευθυνση

source: Call us now
el: Καλώ

source: copy footer
el: ©2024 XXXXXXX. Всички права запазени.

source: Your account
el: Το προφίλ σου

source: Filters
el: Φίλτρα

source: Loading...
el: Φόρτωση…

source: My Cart
el: Το καρότσι μου

source: Your bag is empty
el: Το καλάθι είναι άδειο

source: Continue shopping
el: Συνεχίστε τις αγορές

source: To cart
el: Συνεχίστε τις αγορές

source: Remove
el: Αφαιρώ

source: Calculate at checkout
el: Τα έξοδα αποστολής χρεώνονται στο ταμείο.

source: Free shipping
el: Δωρεάν αποστολή

source: Checkout
el: ΟΛΟΚΛΗΡΩΣΗ ΑΓΟΡΑΣ

source: You are
el: Σου έχουν μείνει

source: away from free delivery
el: σε ΔΩΡΕΑΝ ΑΠΟΣΤΟΛΗ

source: Congrats! You've reached free shipping.
el: Συγχαρητήρια! Έχετε φτάσει στη δωρεάν αποστολή.

source: Related products
el: Παρόμοια προϊόντα

source: You may also like
el: Μπορεί να σας αρέσει

source: You may be interested in
el: Μπορεί να σας αρέσει περισσότερο

source: Information
el: Πληροφορίες

source: Reviews
el: Κριτικές

source: Gallery
el: Εκθεσιακός χώρος

source: In the box
el: Στο κουτί

source: Video
el: βίντεο

source: BUY NOW
el: ΑΓΟΡΑΣΕ ΤΩΡΑ

source: Prices from:
el: Τιμές από:

source: Quick order with phone
el: Γρήγορη παραγγελία

source: Landing Feature 1
el: Γρήγορες και ασφαλείς αγορές

source: Landing Feature 2
el: Γρήγορες και ασφαλείς αγορές

source: Landing Feature 3
el: Παράδοση σε εταιρεία ταχυμεταφορών ή διεύθυνση

source: Landing Feature 4
el: Χρόνος παράδοσης 1-3 εργάσιμες ημέρες

source: Add to cart
el: Προσθήκη

source: Quick View
el: Γρήγορη αναθεώρηση

source: Your cart
el: Το καλάθι σας

source: Shopping Cart
el: Καροτσάκι

source: Shipping and Checkout
el: Παράδοση και Πληρωμή

source: Confirmation
el: Επιβεβαίωση

source: Select options
el: Επιλέξτε επιλογές

source: Apply Coupon
el: Ισχύουν

source: Enter Coupon Code
el: Εισαγάγετε τον κωδικό προσφοράς

source: In stock
el: Διαθέσιμος

source: Out of stock
el: Εξαντλημένος
